module.exports = {

    /* common code */
    //请求成功
    200: '请求成功',
    //内部服务器错误
    500: '内部服务器错误',

    /* 系统错误（11001-11000） */
    //参数验证错误（此code需要弹出msg的错误信息）
    10001: '参数验证错误',

    /* 后台管理错误（11001-15000） */
    //公告栏（11001-11100）
    //公告更新失败
    11001: '公告更新失败',
    //公告删除失败
    11002: '公告删除失败',
    //公告查询失败
    11003: '公告查询失败',

    /* 前台学生操作错误（20001-未定） */
    //预约相关（20001-30000）
    //预约课程:已上过该topic的lecture课程，是否再次出席
    20001: '已上过该topic的lecture课程，是否再次出席',
    //预约课程:类型不正确出错
    20002: '类型不正确出错',
    //预约课程:您已在该时段预约了其他课程，请重新选择时间
    20003: '您已在该时段预约了其他课程，请重新选择时间',
    //预约课程:您当前可预约课程数量已满，请完成课程后再进行预约!
    20004: '您当前可预约课程数量已满，请完成课程后再进行预约!',
    //预约课程:没有英文名
    20005: '没有英文名',
    //预约课程:必须在预约时间范围内才能预约
    20006: '必须在预约时间范围内才能预约',
    //预约课程:抱歉，该节课预约人数已满，请预约其他课程！
    20008: '抱歉，该节课预约人数已满，请预约其他课程！',
    //预约课程:环讯老师被占用
    20009: '环讯老师被占用',
    //取消预约:预约数据不存在
    20010: '预约数据不存在',
    //取消预约:非法取消预约,取消预约时间不正确!
    20011: '非法取消预约,取消预约时间不正确!',
    //取消预约:取消环讯老师出错
    20012: '取消环讯老师出错',
    //预约课程:未购买课程类型,暂无法进入
    20014: "教室尚未开放，请1分钟以后再进入",
    21001: '未购买课程类型,暂无法进入',
    21002: '必须预约当前级别的课程',
    22001: '课程回顾:当前课程视频回顾不存在',
    22002: '课程回顾:当前课程为webex房间,暂时不支持视频回顾',

    /* 老师（30001-31000） */
    //老师:老师数据不存在
    30001: '老师数据不存在',

    /* 老师排课时间（31001-32000） */
    //老师时间:老师时间数据不存在 
    31001: '老师时间数据不存在',
    //老师时间:老师已经被预约
    31002: '老师已经被预约',

    /* 老师签课时间（32001-33000） */
    //老师签课时间：新增老师签课时间错误
    32001: '新增老师签课时间错误',
    //老师签课时间：删除老师签课时间错误
    32002: '删除老师签课时间错误',
    //老师签课时间：第三方来源教师暂时不支持签课
    32003: '第三方来源教师暂时不支持签课',

    /* 课程相关（40001-41000） */
    //课程数据不存在！
    40001: '课程数据不存在！',

    //课程课件：41001-42000
    //课件数据错误，没有课件完成记录！
    41001: '课件数据错误，没有课件完成记录！',

    //合同相关（50001-60000）
    //合同：合同相关信息不存在
    50001: '合同相关信息不存在',
    //合同：您没有该课程的可用课时数，无法预约！
    50002: '您没有该课程的可用课时数，无法预约！',

    70004: '您的操作已超时，请重新登录后操作',

    70005: '老密码输入错误',
    90001: '重复保存测试结果',
    70006: '身份证重复',
    70007: '手机号已被使用'
};